{
  "controllerArray": [false,false,false,false,false,false,false,false,false,false,false,false],
  "generalArray": [
    {
      "description": "Sei gruppi separati formati ciascuno da due tessere adiacenti dello stesso tipo (non necessariamente come mostrato in figura). Le tessere di un gruppo possono essere diverse da quelle di un altro gruppo. "
    },
    {
      "description": "Quattro tessere dello stesso tipo ai quattro angoli della Libreria"
    },
    {
      "description": "Quattro gruppi separati formati ciascuno da quattro tessere adiacenti dello stesso tipo (non necessariamente come mostrato in figura). Le tessere di un gruppo possono essere diverse da quelle di un altro gruppo"
    },
    {
      "description": "Due gruppi separati di 4 tessere dello stesso tipo che formano un quadrato 2x2. Le tessere dei due gruppi devono essere dello stesso tipo"
    },
    {
      "description": "Tre colonne formate ciascuna da 6 tessere di uno, due o tre tipi differenti. Colonne diverse possono avere combinazioni diverse di tipi di tessere."
    },
    {
      "description": "Otto tessere dello stesso tipo. Non ci sono restrizioni sulla posizione di queste tessere"
    },
    {
      "description": "Cinque tessere dello stesso tipo che formano una diagonale"
    },
    {
      "description": "Quattro righe formate ciascuna da 5 tessere di uno, due o tre tipi differenti. Righe diverse possono avere combinazioni diverse di tipi di tessere"
    },
    {
      "description": "Due colonne formate ciascuna da 6 diversi tipi di tessere"
    },
    {
      "description": "Due righe formate ciascuna da 5 diversi tipi di tessere."
    },
    {
      "description": "Cinque tessere dello stesso tipo che formano una X"
    },
    {
      "description": "Cinque colonne di altezza crescente o decrescente: a partire dalla prima colonna a sinistra o a destra, ogni colonna successiva deve essere formata da una tessera in più. Le tessere possono essere di qualsiasi tipo"
    }
  ]
}